# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

cask_args appdir: '/Applications'

# Formulae

brew 'coreutils'
brew 'git'
brew 'git-flow'
brew 'git-lfs'
brew 'openssl'
brew 'vim'
brew 'tmux'
brew 'wget'
brew 'asdf'
brew 'cmake'
brew 'tmux'
brew 'postgresql'
brew 'z'
brew 'watchman'
brew 'swiftlint'
brew 'carthage'
brew 'ack'
brew 'gh'
brew 'diff-so-fancy'
brew 'hugo'
brew 'tree'
brew 'chisel'
brew 'mysql'
brew 'postgresql'
brew 'sqlite'
brew 'yarn'
brew 'youtube-dl'
brew 'mitmproxy'
brew 'antigen'
brew 'gpg2'
brew 'aria2'
brew 'awscli'

# Programming Languages

brew 'golang'

# Casks

cask 'dash4'
cask 'docker'
cask 'visual-studio-code'
cask 'telegram'
cask 'the-unarchiver'
cask 'hammerspoon'
cask 'sublime-merge'
cask 'postman'
cask 'logseq'
cask 'font-jetbrains-mono'
