# Taps
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'

cask_args appdir: '/Applications'

# Formulae

brew 'coreutils'
brew 'git'
brew 'openssl'
brew 'vim'
brew 'zsh'
brew 'antigen'
brew 'tmux'
brew 'wget'
brew 'rbenv'
brew 'imagemagick'
brew 'nvm'
brew 'cmake'
brew 'ninja'
brew 'tmux'
brew 'postgresql'
brew 'z'
brew 'watchman'
brew 'swiftlint'
brew 'carthage'
brew 'ack'

# Casks

cask 'alfred'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'sourcetree'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'spotify'
cask 'realm-browser'
cask 'dropbox'
cask 'kdiff3'
cask 'notion'
cask 'the-unarchiver'
cask 'origami-studio'
cask 'rescuetime'
cask 'react-native-debugger'
