# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask-fonts'

cask_args appdir: '/Applications'

# Formulae

brew 'coreutils'
brew 'git'
brew 'git-flow'
brew 'git-lfs'
brew 'openssl'
brew 'vim'
brew 'tmux'
brew 'wget'
brew 'rbenv'
brew 'pyenv'
brew 'imagemagick'
brew 'nvm'
brew 'cmake'
brew 'tmux'
brew 'postgresql'
brew 'z'
brew 'watchman'
brew 'swiftlint'
brew 'carthage'
brew 'ack'
brew 'hub'
brew 'diff-so-fancy'
brew 'hugo'
brew 'git-flow'
brew 'exercism'
brew 'tree'
brew 'chisel'
brew 'dep'
brew 'mysql'
brew 'postgresql'
brew 'sqlite'
brew 'yarn'
brew 'youtube-dl'
brew 'mitmproxy'

# Programming Languages

brew 'golang'

# Casks

cask 'alfred3'
cask 'dash4'
cask 'docker'
cask 'google-chrome'
cask 'iterm2'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'spotify'
cask 'slack'
cask 'telegram'
cask 'the-unarchiver'
cask 'hammerspoon'
cask 'sublime-merge'
cask 'font-iosevka'
cask 'font-iosevka-slab'
cask 'postman'
cask 'react-native-debugger'
